# Taps
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'adoptopenjdk/openjdk'
tap 'ankitpokhrel/jira-cli'
tap 'aquasecurity/trivy'
tap 'dbt-labs/dbt'
tap 'rbenv/tap'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

## all installed
brew 'autojump'
brew 'bat'
brew 'bpytop'
brew 'ca-certificates'
brew 'cfssl'
brew 'cowsay'
brew 'docker'
brew 'exercism'
brew 'fastlane'
brew 'fd'
brew 'figlet'
brew 'fontconfig'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'graphite2'
brew 'jira-cli'
brew 'jq'
brew 'jsonnet'
brew 'jsonnet-bundler'
brew 'k9s'
brew 'krb5'
brew 'kubeseal'
brew 'libyubikey'
brew 'lolcat'
brew 'lsd'
brew 'lua'
brew 'mono'
brew 'neovim'
brew 'node'
brew 'openjdk'
brew 'openjdk@8'
brew 'openssl@1.0'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'osx-cpu-temp'
brew 'perl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pkg-config'
brew 'pyenv'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.7'
brew 'python@3.8'
brew 'python@3.9'
brew 'ranger'
brew 'ruby'
brew 'thefuck'
brew 'tldr'
brew 'todoist'
brew 'tree'
brew 'tree-sitter'
brew 'trivy'
brew 'vim'
brew 'wget'
brew 'yarn'

cask 'adoptopenjdk11'
cask 'adoptopenjdk13'
cask 'adoptopenjdk15'
cask 'alt-tab'
cask 'chromedriver'
cask 'coconutbattery'
cask 'docker'
cask 'fig'
cask 'flutter'
cask 'gulp'
cask 'iterm2'
cask 'meetingbar'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'todoist'
cask 'visual-studio-code'
cask 'wireshark'


# Apps
cask '1password'
cask 'caffeine'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#cas 'Byword', id: 420212497
#cas 'Giphy Capture', id: 668208984
#cas 'Keynote', id: 409183694
#cas 'Numbers', id: 409203825
#cas 'Speedtest', id: 1153157709
#cas 'Spring', id: 1508706541
#cas 'Things', id: 904280696
